Repository: Ahmad-Almosallam/PadelPass
Catalog: src/PadelPass.Core/Resources/GlobalResource.*.resx
Languages: ar

source: Not found
ar: غير موجود

source: User not found
ar: المستخدم غير موجود

source: Club not found
ar: النادي غير موجود

source: Subscription plan not found
ar: خطة الاشتراك غير موجودة

source: Subscription not found
ar: الاشتراك غير موجود

source: Non-peak slot not found
ar: فترة الوقت غير المزدحم غير موجودة

source: Club user not found
ar: مستخدم النادي غير موجود

source: Created successfully
ar: تم الإنشاء بنجاح

source: Updated successfully
ar: تم التحديث بنجاح

source: Deleted successfully
ar: تم الحذف بنجاح

source: Club created successfully
ar: تم إنشاء النادي بنجاح

source: Club updated successfully
ar: تم تحديث النادي بنجاح

source: Club deleted successfully
ar: تم حذف النادي بنجاح

source: Subscription plan created successfully
ar: تم إنشاء خطة الاشتراك بنجاح

source: Subscription plan updated successfully
ar: تم تحديث خطة الاشتراك بنجاح

source: Subscription plan deleted successfully
ar: تم حذف خطة الاشتراك بنجاح

source: Subscription created successfully
ar: تم إنشاء الاشتراك بنجاح

source: Subscription updated successfully
ar: تم تحديث الاشتراك بنجاح

source: Subscription deleted successfully
ar: تم حذف الاشتراك بنجاح

source: Subscription canceled successfully
ar: تم إلغاء الاشتراك بنجاح

source: Subscription extended successfully
ar: تم تمديد الاشتراك بنجاح

source: Subscription paused successfully
ar: تم إيقاف الاشتراك مؤقتاً بنجاح

source: Subscription resumed successfully
ar: تم استئناف الاشتراك بنجاح

source: Non-peak slot created successfully
ar: تم إنشاء فترة الوقت غير المزدحم بنجاح

source: Non-peak slot updated successfully
ar: تم تحديث فترة الوقت غير المزدحم بنجاح

source: Non-peak slot deleted successfully
ar: تم حذف فترة الوقت غير المزدحم بنجاح

source: Club user created successfully
ar: تم إنشاء مستخدم النادي بنجاح

source: Club user updated successfully
ar: تم تحديث مستخدم النادي بنجاح

source: Club user deleted successfully
ar: تم حذف مستخدم النادي بنجاح

# CheckInSuccessful
source: Check-in successful for {0}
ar: تم تسجيل الحضور بنجاح لـ {0}

# UserWithEmailExists
source: User with this email already exists
ar: يوجد مستخدم بهذا البريد الإلكتروني بالفعل

source: Invalid email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

source: Invalid refresh token
ar: رمز التحديث غير صالح

# RefreshTokenExpired
source: Refresh token has expired
ar: انتهت صلاحية رمز التحديث

source: Admin user created successfully
ar: تم إنشاء المستخدم المشرف بنجاح

source: Logout successful
ar: تم تسجيل الخروج بنجاح

source: User not authenticated
ar: المستخدم غير مصدق عليه

source: Unauthorized
ar: غير مُرَخَّص

source: Unauthorized access
ar: وصول غير مُرَخَّص

# EmailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

source: Invalid email format
ar: تنسيق البريد الإلكتروني غير صحيح

# PhoneNumberRequired
source: Phone number is required
ar: رقم الهاتف مطلوب

# PhoneNumberMaxLength
source: Phone number cannot exceed 20 characters
ar: لا يمكن أن يتجاوز رقم الهاتف 20 رمزاً

# FullNameRequired
source: Full name is required
ar: الاسم الكامل مطلوب

# FullNameMaxLength
source: Full name cannot exceed 100 characters
ar: لا يمكن أن يتجاوز الاسم الكامل 100 رمز

# PasswordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# PasswordMinLength
source: Password must be at least 6 characters long
ar: يجب أن تكون كلمة المرور على الأقل 6 أحرف

# PasswordMaxLength
source: Password cannot exceed 50 characters
ar: لا يمكن أن تتجاوز كلمة المرور 50 رمزاً

# ConfirmPasswordRequired
source: Confirm password is required
ar: تأكيد كلمة المرور مطلوب

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# RefreshTokenRequired
source: Refresh token is required
ar: رمز التحديث مطلوب

# NameRequired
source: Name is required
ar: الاسم مطلوب

# NameMaxLength
source: Name cannot exceed {0} characters
ar: لا يمكن أن يتجاوز الاسم {0} رمزاً

# NameMinLength
source: Name must be at least {0} characters long
ar: يجب أن يكون الاسم على الأقل {0} أحرف

# AddressMaxLength
source: Address cannot exceed 500 characters
ar: لا يمكن أن يتجاوز العنوان 500 رمز

# LatitudeRange
source: Latitude must be between -90 and 90
ar: يجب أن يكون خط العرض بين -90 و 90

# LongitudeRange
source: Longitude must be between -180 and 180
ar: يجب أن يكون خط الطول بين -180 و 180

# DurationRequired
source: Duration is required
ar: المدة مطلوبة

# DurationRange
source: Duration must be between 1 and 36 months
ar: يجب أن تكون المدة بين شهر واحد و 36 شهراً

# PriceRequired
source: Price is required
ar: السعر مطلوب

# PriceGreaterThanZero
source: Price must be greater than 0
ar: يجب أن يكون السعر أكبر من 0

# ClubIdRequired
source: Club ID is required
ar: معرف النادي مطلوب

source: Invalid day of week
ar: يوم الأسبوع غير صحيح

# StartTimeRequired
source: Start time is required
ar: وقت البداية مطلوب

# EndTimeRequired
source: End time is required
ar: وقت النهاية مطلوب

# EndTimeAfterStartTime
source: End time must be after start time
ar: يجب أن يكون وقت النهاية بعد وقت البداية

# PlanIdRequired
source: Plan ID is required
ar: معرف الخطة مطلوب

# AdditionalMonthsRequired
source: Number of additional months is required
ar: عدد الأشهر الإضافية مطلوب

# AdditionalMonthsRange
source: Additional months must be between 1 and 36
ar: يجب أن تكون الأشهر الإضافية بين شهر واحد و 36 شهراً

# ErrorOccurredWhileRetrieving
source: An error occurred while retrieving the {0}
ar: حدث خطأ أثناء استرداد {0}

# ErrorOccurredWhileCreating
source: An error occurred while creating the {0}
ar: حدث خطأ أثناء إنشاء {0}

# ErrorOccurredWhileUpdating
source: An error occurred while updating the {0}
ar: حدث خطأ أثناء تحديث {0}

# ErrorOccurredWhileDeleting
source: An error occurred while deleting the {0}
ar: حدث خطأ أثناء حذف {0}

# ErrorOccurredDuringRegistration
source: An error occurred during user registration
ar: حدث خطأ أثناء تسجيل المستخدم

# ErrorOccurredDuringLogin
source: An error occurred during login
ar: حدث خطأ أثناء تسجيل الدخول

# ErrorOccurredWhileRefreshingToken
source: An error occurred while refreshing the token
ar: حدث خطأ أثناء تحديث الرمز المميز

# ErrorOccurredWhileCreatingAdmin
source: An error occurred while creating the admin user
ar: حدث خطأ أثناء إنشاء المستخدم المشرف

# ErrorOccurredDuringLogout
source: An error occurred during logout
ar: حدث خطأ أثناء تسجيل الخروج

# ErrorOccurredWhileProcessingCheckIn
source: An error occurred while processing the check-in
ar: حدث خطأ أثناء معالجة تسجيل الحضور

# UserAlreadyHasActiveSubscription
source: User already has an active subscription
ar: المستخدم لديه اشتراك نشط بالفعل

source: Invalid user type
ar: نوع المستخدم غير صحيح

# UserIsNotCustomer
source: User is not an customer
ar: المستخدم ليس عميلاً

# UserDoesNotHaveActiveSubscription
source: User does not have an active subscription
ar: المستخدم ليس لديه اشتراك نشط

# UserAlreadyCheckedInToday
source: User has already checked in to this club today
ar: المستخدم قام بتسجيل الحضور في هذا النادي اليوم بالفعل

# CheckInOnlyDuringNonPeakHours
source: Check-in is only allowed during non-peak hours
ar: تسجيل الحضور مسموح فقط خلال الأوقات غير المزدحمة

# SubscriptionNotActive
source: Subscription is not active
ar: الاشتراك غير نشط

# CannotExtendInactiveSubscription
source: Cannot extend an inactive subscription
ar: لا يمكن تمديد اشتراك غير نشط

# CannotPauseInactiveSubscription
source: Cannot pause an inactive subscription
ar: لا يمكن إيقاف اشتراك غير نشط مؤقتاً

# SubscriptionAlreadyPaused
source: Subscription is already paused
ar: الاشتراك متوقف مؤقتاً بالفعل

# SubscriptionAlreadyExpired
source: Subscription has already expired
ar: الاشتراك منتهي الصلاحية بالفعل

# CannotResumeInactiveSubscription
source: Cannot resume an inactive subscription
ar: لا يمكن استئناف اشتراك غير نشط

# SubscriptionNotPaused
source: Subscription is not paused
ar: الاشتراك غير متوقف مؤقتاً

source: Subscription has no remaining days
ar: الاشتراك ليس لديه أيام متبقية

# UserAlreadyAssociatedWithClub
source: This user is already associated with this club
ar: هذا المستخدم مرتبط بهذا النادي بالفعل

# PasswordConfirmationDoNotMatch
source: Password and confirmation do not match
ar: كلمة المرور والتأكيد غير متطابقين

# FailedToCreateUser
source: Failed to create user: {0}
ar: فشل في إنشاء المستخدم: {0}

# EitherUserIdOrRegisterDtoRequired
source: Either UserId or RegisterDto must be provided
ar: يجب توفير معرف المستخدم أو بيانات التسجيل

# PhoneNumberBelongsToNonRegularUser
source: The phone number belongs to a non-regular user
ar: رقم الهاتف ينتمي إلى مستخدم غير عادي

# NoUserFoundWithPhoneNumber
source: No user found with phone number {0}
ar: لم يتم العثور على مستخدم برقم الهاتف {0}

# UserIsNotRegularUser
source: User with ID {0} is not a regular user
ar: المستخدم بالمعرف {0} ليس مستخدماً عادياً

# NoAccessToClubs
source: You don't have access to any clubs
ar: ليس لديك إمكانية الوصول إلى أي نادي

# NoAccessToThisClub
source: You don't have access to this club
ar: ليس لديك إمكانية الوصول إلى هذا النادي

# UnauthorizedToUpdateSubscription
source: Unauthorized to update this subscription
ar: غير مُرَخَّص لتحديث هذا الاشتراك

# UnauthorizedToDeleteSubscription
source: Unauthorized to delete this subscription
ar: غير مُرَخَّص لحذف هذا الاشتراك

# UnauthorizedToCancelSubscription
source: Unauthorized to cancel this subscription
ar: غير مُرَخَّص لإلغاء هذا الاشتراك

# UnauthorizedToExtendSubscription
source: Unauthorized to extend this subscription
ar: غير مُرَخَّص لتمديد هذا الاشتراك

# UnauthorizedToPauseSubscription
source: Unauthorized to pause this subscription
ar: غير مُرَخَّص لإيقاف هذا الاشتراك مؤقتاً

# UnauthorizedToResumeSubscription
source: Unauthorized to resume this subscription
ar: غير مُرَخَّص لاستئناف هذا الاشتراك

# UnexpectedErrorOccurred
source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.

source: club
ar: النادي

source: subscription plan
ar: خطة الاشتراك

source: subscription
ar: الاشتراك

source: non-peak slot
ar: فترة الوقت غير المزدحم

source: club user
ar: مستخدم النادي

source: user
ar: المستخدم

# UserWithPhoneNumberExists
source: A user with the phone number {0} already exists.
ar: يوجد مستخدم بالفعل برقم الهاتف {0}.
